'''
2 --> 1 : 2
3 --> 1 : 3
4 --> 1 : 2+2 
5 --> 2 : 3+2 5
6 --> 2 : 3+3 2+2+2
7 --> 3 : 7 5+2 3+2+2
8 --> 3 : 5+3 3+3+2 2+2+2+2 
9 --> 4 : 7+2 5+2+2 3+3+3 3+2+2+2
10 --> 5 : 7+3 5+5 5+3+2 3+3+2+2 2+2+2+2+2
11 --> 6 : 11 7+2+2 5+3+3 5+2+2+2 3+3+3+2 3+2+2+2+2 
...
30 --> 23+7 23+5+2 23+3+2+2 19+7+2+2 19+5+3+3 19+5+2+2+2 17+ 

'''
n = int(input())

Prime = [2]

for i in range(3,n+1):
    for j in Prime:
        if i%j == 0:
            break
        
    else:
        Prime.append(i)

# from others..
dp = [0 for _ in range(n+1)]
dp[0] = 1
for p in Prime:
    for i in range(p, n+1):
        dp[i] = (dp[i] + dp[i-p]) % 123456789
    
print(dp[-1])

#! python으로 안돌아감, pypy3로 통과.
 